Revit 2027 API
BRepBuilderPersistentIds Constructor
 Constructs a new BRepBuilderPersistentIds and associates the existing BRepBuilder to it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BRepBuilderPersistentIds(
	BRepBuilder bRepBuilder
)
Public Sub New (
	bRepBuilder As BRepBuilder
)
public:
BRepBuilderPersistentIds(
	BRepBuilder^ bRepBuilder
)
new :
        bRepBuilder : BRepBuilder -> BRepBuilderPersistentIds
Parameters
bRepBuilder BRepBuilder
 The existing BRepBuilder.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace